In [1]:
import pandas as pd

df = pd.read_excel('.\Dataset\Haircut Tip Amounts.xlsx', 'Sheet1', skiprows=2)

c:\users\olive\documents\6. semester\mandatories\aai_first_mandatory\.venv\lib\site-packages\openpyxl\worksheet\_reader.py:312: UserWarning: Unknown extension is not supported and will be removed
  warn(msg)

In [2]:
print(df)

    Tip amount  Time   Day Culture Married   Age  Unnamed: 6  Unnamed: 7  \
0            0   5.0   Fri       I      NM  30.0         NaN         NaN
1            1   2.0   Tue       E      NM  10.0         NaN         NaN
2            1   7.0  Tues       I      NM  35.0         NaN         NaN
3            2   5.0   Mon       I      NM  35.0         NaN         NaN
4            2  12.0   Fri       M      NM  15.0         NaN         NaN
..         ...   ...   ...     ...     ...   ...         ...         ...
229         10   1.0   Sat       W       M  40.0         NaN         NaN
230          1  13.0   Sat       I      NM  10.0         NaN         NaN
231          5  14.0   Sat       W       M  36.0         NaN         NaN
232          3  15.0   Sat       W      NM   8.0         NaN         NaN
233          5  16.0   Fri       I      NM  35.0         NaN         NaN

    Culture Codes        Unnamed: 9
0               I            Indian
1               E          European
2               B  African American
3               W          American
4               P        Phillipino
..            ...               ...
229           NaN               NaN
230           NaN               NaN
231           NaN               NaN
232           NaN               NaN
233           NaN               NaN

[234 rows x 10 columns]

In [3]:
df.drop('Culture Codes', inplace=True, axis=1)
df.drop('Unnamed: 9', inplace=True, axis=1)
df.drop('Unnamed: 6', inplace=True, axis=1)
df.drop('Unnamed: 7', inplace=True, axis=1)

print(df)

    Tip amount  Time   Day Culture Married   Age
0            0   5.0   Fri       I      NM  30.0
1            1   2.0   Tue       E      NM  10.0
2            1   7.0  Tues       I      NM  35.0
3            2   5.0   Mon       I      NM  35.0
4            2  12.0   Fri       M      NM  15.0
..         ...   ...   ...     ...     ...   ...
229         10   1.0   Sat       W       M  40.0
230          1  13.0   Sat       I      NM  10.0
231          5  14.0   Sat       W       M  36.0
232          3  15.0   Sat       W      NM   8.0
233          5  16.0   Fri       I      NM  35.0

[234 rows x 6 columns]

In [6]:
df.iloc[[114, 115]]

,Tip amount,Time,Day,Culture,Married,Age
114,NaN,NaN,NaN,NaN,NaN,NaN
115,THE DATA BELOW THIS POINT IS FORMATTED MUCH CL...,NaN,NaN,NaN,NaN,NaN

In [7]:
df.dropna(subset = ["Day"], inplace=True)

In [8]:
df.iloc[[114, 115]]

    Tip amount  Time  Day Culture Married   Age
116         20  10.0  mon       P      NM  30.0
117          5  11.0  mon       W      NM  16.0

In [9]:
print(df)

    Tip amount  Time   Day Culture Married   Age
0            0   5.0   Fri       I      NM  30.0
1            1   2.0   Tue       E      NM  10.0
2            1   7.0  Tues       I      NM  35.0
3            2   5.0   Mon       I      NM  35.0
4            2  12.0   Fri       M      NM  15.0
..         ...   ...   ...     ...     ...   ...
229         10   1.0   Sat       W       M  40.0
230          1  13.0   Sat       I      NM  10.0
231          5  14.0   Sat       W       M  36.0
232          3  15.0   Sat       W      NM   8.0
233          5  16.0   Fri       I      NM  35.0

[232 rows x 6 columns]